---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImageFailures.BadViewType
source: html/b82ea02c-3363-c31c-3132-0b9ed71ced46.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImageFailures.BadViewType Property

Image Instances can't be placed in 3D Views.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadViewType { get; }
```